app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2019-08-04 18:08:55.708843"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name))